#### Pandas- data frames and series

##### Pandas is a powerful data manipulation library in Python , widely used for data Analysis and data cleaning.It provides two primary data structure : Series and Data Frame. A series is a one-dimensional array-like object , while data frame is a two dimensional , size mutable , and potentially heterogenous tabular data structure with labled axes (rows and columns)

In [1]:
import pandas as pd

In [3]:
## series is basically a one dimensional array-like object that can hold any data type. It is similar to a cloumn in a table.

import pandas as pd

data=[1,2,3,4,5]
series=pd.Series(data)
print("series\n",series)
print(type(series))

series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
## create a series from dictionary
data={'a':1,'b':2,'c':3}
series_data=pd.Series(data)
print(series_data)

a    1
b    2
c    3
dtype: int64

In [5]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [6]:
## Data frame(here we can have multiple rows and columns)
## create a dataframe from a dictionary of list

data={
  'name':['krish','john','jack'],
  'age':[25,30,54],
  'city':['banglore','new york','chicago']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

    name  age      city
0  krish   25  banglore
1   john   30  new york
2   jack   54   chicago
<class 'pandas.core.frame.DataFrame'>

In [7]:
import numpy as np

np.array(df)

array([['krish', 25, 'banglore'],
       ['john', 30, 'new york'],
       ['jack', 54, 'chicago']], dtype=object)

In [ ]:
## create a data frame from a list of dictionaries

data=[
  {'name':'krish','age':32,'city':'banglore'},
  {'name':'john','age':42,'city':'new york'},
  {'name':'jack','age':25,'city':'chicago'}
]

df=pd.DataFrame(data)
print(df)
print(type(df))

    name  age      city
0  krish   32  banglore
1   john   42  new york
2   jack   25   chicago

In [ ]:
df1=pd.read_csv('Sales_online.csv')
df1.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [16]:
data=[
  {'name':'krish','age':32,'city':'banglore'},
  {'name':'john','age':42,'city':'new york'},
  {'name':'jack','age':25,'city':'chicago'}
]

df=pd.DataFrame(data)
print(df)
print(type(df))

    name  age      city
0  krish   32  banglore
1   john   42  new york
2   jack   25   chicago
<class 'pandas.core.frame.DataFrame'>

In [ ]:
type(df['name']) ## if we check the type then it will be a series because we just picked a single key from the table

pandas.core.series.Series

In [ ]:
df.loc[0] # used to display just the exact index values that you want

name       krish
age           32
city    banglore
Name: 0, dtype: object

In [ ]:
df.iloc[0][0] # we can use this index location to know the exact location , to probably get some information here

C:\Users\Len\AppData\Local\Temp\ipykernel_21264\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'krish'

In [25]:
## accessing a specified element

df.at[1,'age']

np.int64(42)

In [26]:
## accesing a specified element using iat

df.iat[2,2]

'chicago'

In [27]:
## data manipulation using data frame

df

    name  age      city
0  krish   32  banglore
1   john   42  new york
2   jack   25   chicago

In [ ]:
## adding a column
df['salary']=[50000,60000,70000]
df

    name  age      city  salary
0  krish   32  banglore   50000
1   john   42  new york   60000
2   jack   25   chicago   70000

In [ ]:
## removing a column

df.drop('salary')
df

KeyError: "['salary'] not found in axis"

In [32]:
## we got an above error because by default the axis is 0 meaning it is checking the row indexes and that does not have a entity named salary

df.drop('salary',axis=1)

    name  age      city
0  krish   32  banglore
1   john   42  new york
2   jack   25   chicago

In [ ]:
## using inplace : if you will do any drop operation it will do that permanently

df.drop('salary',axis=1,inplace=True)

In [34]:
df

    name  age      city
0  krish   32  banglore
1   john   42  new york
2   jack   25   chicago

In [37]:
## add age to the column
df['age']=df['age']+1
df

    name  age      city
0  krish   35  banglore
1   john   45  new york
2   jack   28   chicago

In [38]:
df.drop(0)

   name  age      city
1  john   45  new york
2  jack   28   chicago

In [39]:
df

    name  age      city
0  krish   35  banglore
1   john   45  new york
2   jack   28   chicago

In [40]:
df1.describe()

             age
count   3.000000
mean   33.000000
std     8.544004
min    25.000000
25%    28.500000
50%    32.000000
75%    37.000000
max    42.000000

In [41]:
df1=pd.read_csv('Sales_online.csv')
df1.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [ ]:
df1.describe() ## it is used to describe some basic math concepts that you need to know like mean,count,std,mode,min

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000